{
    "_class_name": "OnnxStableDiffusionPipeline",
    "_diffusers_version": "0.15.0.dev0",
    "feature_extractor": [
      "transformers",
      "CLIPImageProcessor"
    ],
    "requires_safety_checker": true,
    "safety_checker": [
      "diffusers",
      "AICRuntimeModel"
    ],
    "scheduler": [
      "diffusers",
      "PNDMScheduler"
    ],
    "text_encoder": [
      "diffusers",
      "AICRuntimeModel"
    ],
    "tokenizer": [
      "transformers",
      "CLIPTokenizer"
    ],
    "unet": [
      "diffusers",
      "AICRuntimeModel"
    ],
    "vae_decoder": [
      "diffusers",
      "AICRuntimeModel"
    ],
    "vae_encoder": [
      "diffusers",
      "AICRuntimeModel"
    ]
  }